Repository: jeevanms003/Expense-tracker-app
Catalog: lib/l10n/app_*.arb
Languages: kn

# appTitle
source: Expense Tracker
kn: ವೆಚ್ಚ ಟ್ರ್ಯಾಕರ್

source: Home
kn: ಮುಖಪುಟ

source: Dashboard
kn: ಡಾಶ್‌ಬೋರ್ಡ್

source: Budgets
kn: ಬಜೆಟ್‌ಗಳು

source: Reports
kn: ವರದಿಗಳು

source: Settings
kn: ಸೆಟ್ಟಿಂಗ್ಸ್

source: Title
kn: ಶೀರ್ಷಿಕೆ

source: Amount (₹)
kn: ಮೊತ್ತ (₹)

source: No Date Chosen
kn: ದಿನಾಂಕ ಆಯ್ಕೆಯಾಗಿಲ್ಲ

source: Choose Date
kn: ದಿನಾಂಕ ಆಯ್ಕೆಮಾಡಿ

source: Select Category
kn: ವರ್ಗ ಆಯ್ಕೆಮಾಡಿ

source: Add Category
kn: ವರ್ಗ ಸೇರಿಸಿ

source: Add Transaction
kn: ವಹಿವಾಟು ಸೇರಿಸಿ

source: Current Budgets
kn: ಪ್ರಸ್ತುತ ಬಜೆಟ್‌ಗಳು

source: Set Budget
kn: ಬಜೆಟ್ ಹೊಂದಿಸಿ

source: Budget Amount (₹)
kn: ಬಜೆಟ್ ಮೊತ್ತ (₹)

source: No Month Chosen
kn: ತಿಂಗಳು ಆಯ್ಕೆಯಾಗಿಲ್ಲ

source: Choose Month
kn: ತಿಂಗಳು ಆಯ್ಕೆಮಾಡಿ

source: Add Budget
kn: ಬಜೆಟ್ ಸೇರಿಸಿ

# budgetAdded
source: Budget for {month} added
kn: {month} ಗೆ ಬಜೆಟ್ ಸೇರಿಸಲಾಗಿದೆ

source: Category Name
kn: ವರ್ಗದ ಹೆಸರು

# categoryAdded
source: Category "{categoryName}" added
kn: ವರ್ಗ "{categoryName}" ಸೇರಿಸಲಾಗಿದೆ

# fillAllFields
source: Please fill all fields
kn: ದಯವಿಟ್ಟು ಎಲ್ಲಾ ಕ್ಷೇತ್ರಗಳನ್ನು ಭರ್ತಿ ಮಾಡಿ

# amountPositive
source: Amount must be greater than 0
kn: ಮೊತ್ತ 0 ಕ್ಕಿಂತ ಹೆಚ್ಚಿರಬೇಕು

# categoryEmpty
source: Category name cannot be empty
kn: ವರ್ಗದ ಹೆಸರು ಖಾಲಿಯಾಗಿರಬಾರದು

# categoryExists
source: Category already exists
kn: ವರ್ಗ ಈಗಾಗಲೇ ಇದೆ

source: Budget deleted
kn: ಬಜೆಟ್ ಅಳಿಸಲಾಗಿದೆ

# noTransactions
source: No transactions available
kn: ಯಾವುದೇ ವಹಿವಾಟುಗಳು ಲಭ್ಯವಿಲ್ಲ

source: Refresh
kn: ರಿಫ್ರೆಶ್

source: Daily
kn: ದೈನಂದಿನ

source: Weekly
kn: ಸಾಪ್ತಾಹಿಕ

source: Monthly
kn: ಮಾಸಿಕ

source: Yearly
kn: ವಾರ್ಷಿಕ

source: Current Month Budgets
kn: ಪ್ರಸ್ತುತ ತಿಂಗಳ ಬಜೆಟ್‌ಗಳು

source: Language
kn: ಭಾಷೆ

source: English
kn: ಇಂಗ್ಲಿಷ್

source: Hindi
kn: ಹಿಂದಿ

source: Kannada
kn: ಕನ್ನಡ

source: Select Payment Method
kn: ಪಾವತಿ ವಿಧಾನ ಆಯ್ಕೆಮಾಡಿ

source: Recurring Transaction
kn: ಪುನರಾವರ್ತಿತ ವಹಿವಾಟು

source: Select Frequency
kn: ಆವರ್ತನೆ ಆಯ್ಕೆಮಾಡಿ

source: Search Transactions
kn: ವಹಿವಾಟುಗಳನ್ನು ಹುಡುಕಿ

source: Filter Transactions
kn: ವಹಿವಾಟುಗಳನ್ನು ಫಿಲ್ಟರ್ ಮಾಡಿ

source: Clear Filters
kn: ಫಿಲ್ಟರ್‌ಗಳನ್ನು ತೆರವುಗೊಳಿಸಿ

# minAmount
source: Minimum Amount (₹)
kn: ಕನಿಷ್ಠ ಮೊತ್ತ (₹)

# maxAmount
source: Maximum Amount (₹)
kn: ಗರಿಷ್ಠ ಮೊತ್ತ (₹)

source: Spending by Category
kn: ವರ್ಗದ ಪ್ರಕಾರ ವೆಚ್ಚ

source: Spending by Payment Method
kn: ಪಾವತಿ ವಿಧಾನದ ಪ್ರಕಾರ ವೆಚ್ಚ

source: Suggest
kn: ಸೂಚಿಸಿ

# enterTitleToSuggest
source: Enter a title to suggest details
kn: ವಿವರಗಳನ್ನು ಸೂಚಿಸಲು ಶೀರ್ಷಿಕೆಯನ್ನು ನಮೂದಿಸಿ

source: Suggest Budgets
kn: ಬಜೆಟ್‌ಗಳನ್ನು ಸೂಚಿಸಿ

source: Budget Suggestions
kn: ಬಜೆಟ್ ಸೂಚನೆಗಳು

# noBudgetSuggestions
source: No budget suggestions available
kn: ಯಾವುದೇ ಬಜೆಟ್ ಸೂಚನೆಗಳು ಲಭ್ಯವಿಲ್ಲ

# budgetsAdded
source: Budgets added successfully
kn: ಬಜೆಟ್‌ಗಳನ್ನು ಯಶಸ್ವಿಯಾಗಿ ಸೇರಿಸಲಾಗಿದೆ

source: Cancel
kn: ರದ್ದುಮಾಡಿ

source: Accept All
kn: ಎಲ್ಲವನ್ನೂ ಸ್ವೀಕರಿಸಿ

# noBudgets
source: No budgets set
kn: ಯಾವುದೇ ಬಜೆಟ್‌ಗಳನ್ನು ಹೊಂದಿಸಲಾಗಿಲ್ಲ

source: Voice Input
kn: ಧ್ವನಿ ಇನ್‌ಪುಟ್

# speechNotAvailable
source: Speech recognition is not available
kn: ಧ್ವನಿ ಗುರುತಿಸುವಿಕೆ ಲಭ್ಯವಿಲ್ಲ

# speechError
source: Speech recognition error: {errorMsg}
kn: ಧ್ವನಿ ಗುರುತಿಸುವಿಕೆ ದೋಷ: {errorMsg}

source: No speech detected
kn: ಯಾವುದೇ ಧ್ವನಿ ಕಂಡುಬಂದಿಲ್ಲ

source: Confirm Transaction
kn: ವಹಿವಾಟನ್ನು ದೃಢೀಕರಿಸಿ

# transactionAdded
source: Transaction added successfully
kn: ವಹಿವಾಟು ಯಶಸ್ವಿಯಾಗಿ ಸೇರಿಸಲಾಗಿದೆ

source: Confirm
kn: ದೃಢೀಕರಿಸಿ

source: Listening...
kn: ಕೇಳುತ್ತಿದೆ...

source: Start speaking
kn: ಮಾತನಾಡಲು ಪ್ರಾರಂಭಿಸಿ

source: Stop Listening
kn: ಕೇಳುವುದನ್ನು ನಿಲ್ಲಿಸಿ

source: Apply
kn: ಅನ್ವಯಿಸಿ

source: Spending Insights
kn: ವೆಚ್ಚದ ಒಳನೋಟ

source: Category
kn: ವರ್ಗ

source: Payment Method
kn: ಪಾವತಿ ವಿಧಾನ

# addTransactionVoice
source: Add Transaction via Voice
kn: ಧ್ವನಿಯ ಮೂಲಕ ವಹಿವಾಟು ಸೇರಿಸಿ

source: Suggest Details
kn: ವಿವರಗಳನ್ನು ಸೂಚಿಸಿ

source: Add
kn: ಸೇರಿಸಿ

source: Processing...
kn: ಸಂಸ್ಕರಣೆ...

source: Transaction deleted
kn: ವಹಿವಾಟು ಅಳಿಸಲಾಗಿದೆ

source: Date
kn: ದಿನಾಂಕ

# budgetExists
source: Budget already exists for {categoryName} in {month}
kn: {categoryName} ಗೆ {month} ರಲ್ಲಿ ಬಜೆಟ್ ಈಗಾಗಲೇ ಇದೆ

# budgetUpdated
source: Budget updated successfully
kn: ಬಜೆಟ್ ಯಶಸ್ವಿಯಾಗಿ ನವೀಕರಿಸಲಾಗಿದೆ

source: Edit Transaction
kn: ವಹಿವಾಟು ಸಂಪಾದಿಸಿ

# transactionUpdated
source: Transaction updated successfully
kn: ವಹಿವಾಟು ಯಶಸ್ವಿಯಾಗಿ ನವೀಕರಿಸಲಾಗಿದೆ

source: Save
kn: ಉಳಿಸಿ

source: Spending Over Time
kn: ಕಾಲಾನಂತರದ ವೆಚ್ಚ

# spendingByCategoryTitle
source: Spending by Category
kn: ವರ್ಗದ ಪ್ರಕಾರ ವೆಚ್ಚ

# spendingByPaymentMethodTitle
source: Spending by Payment Method
kn: ಪಾವತಿ ವಿಧಾನದ ಪ್ರಕಾರ ವೆಚ್ಚ

source: Failed to add budget
kn: ಬಜೆಟ್ ಸೇರಿಸಲು ವಿಫಲವಾಗಿದೆ

source: Failed to update budget
kn: ಬಜೆಟ್ ನವೀಕರಿಸಲು ವಿಫಲವಾಗಿದೆ

source: Failed to delete budget
kn: ಬಜೆಟ್ ತೆಗೆದುಹಾಕಲು ವಿಫಲವಾಗಿದೆ

source: Month
kn: ತಿಂಗಳು

source: Edit Budget
kn: ಬಜೆಟ್ ಸಂಪಾದಿಸಿ

source: Invalid category selected
kn: ಅಮಾನ್ಯ ವರ್ಗ ಆಯ್ಕೆಯಾಗಿದೆ

# budgetGoal
source: Financial Goal (Optional)
kn: ಆರ್ಥಿಕ ಗುರಿ (ಐಚ್ಛಿಕ)

source: Dark Mode
kn: ಡಾರ್ಕ್ ಮೋಡ್
